//==============================================================================
//
// ポーズ背景処理〔pause_bg.cpp〕
// Author : Mare Horiai
//
//==============================================================================
#include "main.h"
#include "scene2D.h"
#include "renderer.h"
#include "manager.h"
#include "pause_bg.h"
#include "input.h"

//==============================================================================
// コンストラクタ
//==============================================================================
CPauseBg::CPauseBg(int nPriority) : CScene2D(nPriority)
{

}

//==============================================================================
// デストラクタ
//==============================================================================
CPauseBg::~CPauseBg()
{

}

//==============================================================================
// ポーズ背景の初期化処理
//==============================================================================
HRESULT CPauseBg::Init(D3DXVECTOR3 pos)
{
	// 初期化
	CScene2D::Init(pos);
	CScene2D::SetSize(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2);
	CScene2D::SetCol(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.5f));
	CScene2D::SetTex(1, 1, 0, 0, 0.0f, 0.0f);

	return S_OK;
}

//==============================================================================
// ポーズ背景の終了処理
//==============================================================================
void CPauseBg::Uninit(void)
{

	CScene2D::Uninit();
}

//==============================================================================
// ポーズ背景の更新処理
//==============================================================================
void CPauseBg::Update(void)
{
	// ポーズの状態
	bool bPause = CPause::GetPause();

	D3DXCOLOR col = D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f);

	switch (bPause)
	{
	case true:
		col.a = 0.5f;
		break;

	case false:
		col.a = 0.0f;
		break;
	}

	CScene2D::SetCol(col);
	CScene2D::Update();
}

//==============================================================================
// ポーズ背景の描画処理
//==============================================================================
void CPauseBg::Draw(void)
{
	CScene2D::Draw();
}

//==============================================================================
// ポーズ背景の生成処理
//==============================================================================
CPauseBg *CPauseBg::Create(D3DXVECTOR3 pos)
{
	// インスタンス生成
	CPauseBg *pPauseBg;
	pPauseBg = new CPauseBg;

	// 初期化
	pPauseBg->Init(pos);

	return pPauseBg;
}