//==============================================================================
//
// タイマーロゴ描画処理〔timer_logo.cpp〕
// Author : Mare Horiai
//
//==============================================================================
#include "fall_logo.h"
#include "main.h"
#include "manager.h"
#include "number.h"
#include "renderer.h"
#include "scene2D.h"
#include "texture.h"

//==============================================================================
// コンストラクタ
//==============================================================================
CFallLogo::CFallLogo()
{

}

//==============================================================================
// デストラクタ
//==============================================================================
CFallLogo::~CFallLogo()
{

}

//==============================================================================
// タイマーロゴの初期化処理
//==============================================================================
HRESULT CFallLogo::Init(D3DXVECTOR3 pos, D3DXVECTOR2 size)
{
	// 2Dポリゴンを生成
	m_pScene2D = CScene2D::Create();

	if (m_pScene2D != NULL)
	{
		// 位置設定
		m_pScene2D->SetPosition(pos);

		// サイズ設定
		m_pScene2D->SetSize(size);

		// テクスチャ設定
		m_pScene2D->BindTexture("FALL_LOGO");

		m_pScene2D->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));

		m_pScene2D->SetTex(1, 1, 0, 0, 0, 0);
	}

	return S_OK;
}

//==============================================================================
// タイマーロゴの終了処理
//==============================================================================
void CFallLogo::Uninit(void)
{
	if (m_pScene2D != NULL)
	{
		m_pScene2D->Uninit();
		m_pScene2D = NULL;
	}
}

//==============================================================================
// タイマーロゴの更新処理
//==============================================================================
void CFallLogo::Update(void)
{

}

//==============================================================================
// タイマーロゴの描画処理
//==============================================================================
void CFallLogo::Draw(void)
{

}

//==============================================================================
// タイマーロゴの生成処理
//==============================================================================
CFallLogo *CFallLogo::Create(D3DXVECTOR3 pos, D3DXVECTOR2 size)
{
	// ローカル変数宣言
	CFallLogo *pFallLogo;
	pFallLogo = new CFallLogo;

	// 初期化
	if (pFallLogo != NULL)
	{
		pFallLogo->Init(pos, size);
	}

	return pFallLogo;
}