//==============================================================================
//
// モデル管理〔model.cpp〕
// Author : Mare Horiai
//
//==============================================================================
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "model.h"

// 静的メンバ変数宣言
//LPDIRECT3DTEXTURE9 CTexture::m_pTexture[TEXTYPE_MAX] = {};
char *CModel::m_pFileName[MODELTYPE_MAX] =
{
	{ "data/MODEL/meteor.x" },		// 隕石
	{ "data/MODEL/debri00.x" },		// 宇宙ゴミ0
	{ "data/MODEL/debri01.x" },		// 宇宙ゴミ1
};

//==============================================================================
// コンストラクタ
//==============================================================================
CModel::CModel()
{

}

//==============================================================================
// デストラクタ
//==============================================================================
CModel::~CModel()
{

}

//==============================================================================
// テキストデータの全破棄
//==============================================================================
void CModel::UnloadAll(void)
{
	for (int nCnt = 0; nCnt < MODELTYPE_MAX; nCnt++)
	{
		if (m_pFileName[nCnt] != NULL)
		{
			m_pFileName[nCnt] = NULL;
		}
	}
}