//==============================================================================
//
// 残機数の描画処理〔stock.cpp〕
// Author : Mare Horiai
//
//==============================================================================
#include "main.h"
#include "scene2D.h"
#include "renderer.h"
#include "manager.h"
#include "input.h"
#include "score.h"
#include "number.h"
#include "stock.h"
#include "player.h"

// 静的メンバ変数宣言
int CStock::m_nStock;

//==============================================================================
// コンストラクタ
//==============================================================================
CStock::CStock(int nPriority) : CScene(nPriority)
{
	m_apNumber = NULL;
}

//==============================================================================
// デストラクタ
//==============================================================================
CStock::~CStock()
{
}

//==============================================================================
// 残機数の初期化処理
//==============================================================================
HRESULT CStock::Init(D3DXVECTOR3 pos)
{
	if (m_apNumber == NULL)
	{
		m_apNumber = CNumber::Create(
			D3DXVECTOR3(pos.x, pos.y, 0.0f), 20.0f, 40.0f);
	}

	m_nStock = 2;

	return S_OK;
}

//==============================================================================
// 残機数の終了処理
//==============================================================================
void CStock::Uninit(void)
{
	if (m_apNumber != NULL)
	{// NULLチェック後に破棄
		m_apNumber->Uninit();
		m_apNumber = NULL;
	}

	Release();	// インスタンスのデリート
}

//==============================================================================
// 残機数の更新処理
//==============================================================================
void CStock::Update(void)
{
	// 残機数の設定
	SetStock(m_nStock);
}

//==============================================================================
// 残機数の描画処理
//==============================================================================
void CStock::Draw(void)
{
	// ナンバーの描画
	if (m_apNumber != NULL)
	{
		m_apNumber->Draw();
	}
}

//==============================================================================
// 残機数の生成処理
//==============================================================================
CStock *CStock::Create(D3DXVECTOR3 pos)
{
	// インスタンス生成
	CStock *pStock;
	pStock = new CStock;

	// の初期化
	pStock->Init(pos);

	return pStock;
}

//==============================================================================
// 残機数設定
//==============================================================================
void CStock::SetStock(int nStock)
{
	// 残機数の設定
	m_nStock = CPlayer::GetStcok();

	m_apNumber->SetNumber(m_nStock);
}

//==============================================================================
// 位置の取得
//==============================================================================
D3DXVECTOR3 CStock::GetPosition(void)
{
	D3DXVECTOR3 pos;
	return pos;
}

//==============================================================================
// サイズの取得
//==============================================================================
D3DXVECTOR3 CStock::GetSize(void)
{
	D3DXVECTOR3 size;
	return size;
}