//==============================================================================
//
// 弾ユーザーインターフェースの描画〔bullet_ui.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _BULLET_UI_H_
#define _BULLET_UI_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitBulletUI(void);	// 弾ユーザーインターフェースの初期化処理
void UninitBulletUI(void);	// 弾ユーザーインターフェースの終了処理
void UpdateBulletUI(void);	// 弾ユーザーインターフェースの更新処理
void DrawBulletUI(void);	// 弾ユーザーインターフェースの描画処理

#endif