//==============================================================================
//
// カウンターの描画〔counter.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _COUNTER_H_
#define _COUNTER_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitCounter(void);	// カウンターの初期化処理
void UninitCounter(void);	// カウンターの終了処理
void UpdateCounter(void);	// カウンターの更新処理
void DrawCounter(void);		// カウンターの描画処理

#endif
