////==============================================================================
////
//// エフェクトの描画〔effect.h〕
//// AUTHOR : MARE HORIAI
////
////==============================================================================
//#pragma once
//#ifndef _EFFECT_H_
//#define _EFFECT_H_
//#include "main.h"
//
////==============================================================================
//// マクロ定義
////==============================================================================
//#define MAX_EFFECT	(5000)	// エフェクトポリゴン数の最大値
//
////==============================================================================
//// プロトタイプ宣言
////==============================================================================
//HRESULT InitEffect(void);					// エフェクトの初期化処理
//void UninitEffect(void);					// エフェクトの終了処理
//void UpdateEffect(void);					// エフェクトの更新処理
//void DrawEffect(void);						// エフェクトの描画処理
//void SetEffect(D3DXVECTOR3 pos, int nType);	// エフェクトの設定
//void SetVertexEffect(int nIdx,int nType);	// エフェクトの頂点座標設定
//
//#endif
