//==============================================================================
//
// アイテムの描画〔item.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _ITEM_H_
#define _ITEM_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define MAX_ITEM		(32)		// アイテムの最大数
#define MAX_TYPE_ITEM	(3)			// アイテムの種類
#define ITEM_SIZEX		(20)		// アイテムの幅
#define ITEM_SIZEY		(20)		// アイテムの高さ

//==============================================================================
// アイテムの構造体
//==============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	int nType;			// 種類
	bool bUse;			// 使用しているかどうか
} ITEM;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitItem(void);						// アイテムの初期化処理
void UninitItem(void);						// アイテムの終了処理
void UpdateItem(void);						// アイテムの更新処理
void DrawItem(void);						// アイテムの描画処理
void SetItem(D3DXVECTOR3 pos, int nType);	// アイテムの配置
void SetVertexItem(int nIdx);				// アイテムの頂点座標取得
ITEM *GetItem(void);						// アイテムの情報

#endif
