//==============================================================================
//
// ポーズメニューの描画〔pause.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _PAUSE_H_
#define _PAUSE_H_
#include "main.h"

//==============================================================================
// ポーズメニュー
//==============================================================================
typedef enum
{
	PAUSE_MENU_CONTINUE = 0,	// コンティニュー
	PAUSE_MENU_RETRY,			// リトライ
	PAUSE_MENU_QUIT,			// 終了
	PAUSE_MENU_MAX
} PAUSE_MENU;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitPause(void);	// ポーズメニューの初期化処理
void UninitPause(void);		// ポーズメニューの終了処理
void UpdatePause(void);		// ポーズメニューの更新処理
void DrawPause(void);		// ポーズメニューの描画処理
PAUSE_MENU GetPause(void);	// ポーズの情報取得

#endif
