//==============================================================================
//
// ユーザーインターフェースの描画〔ui.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _UI_H_
#define _UI_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitUI(void);	// ユーザーインターフェースの初期化処理
void UninitUI(void);	// ユーザーインターフェースの終了処理
void UpdateUI(void);	// ユーザーインターフェースの更新処理
void DrawUI(void);		// ユーザーインターフェースの描画処理

#endif