//==============================================================================
//
// 警告画面の描画〔warning.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _WARNING_H_
#define _WARNING_H_
#include "main.h"

//==============================================================================
// 警告モード
//==============================================================================
typedef enum
{
	PHASESTATE_NORMAL = 0,	// 通常状態
	PHASESTATE_WARNING,		// 警告状態
	PHASESTATE_MAX
} PHASESTATE;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitWarning(void);		// 警告画面の初期化処理
void UninitWarning(void);		// 警告画面の終了処理
void UpdateWarning(void);		// 警告画面の更新処理
void DrawWarning(void);			// 警告画面の描画処理
PHASESTATE GetPhase(void);		// 警告画面の情報

#endif
