
//==============================================================================
//
// ゲームモード処理〔exe.cpp〕
// Author : Mare Horiai
//
//==============================================================================
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "exe.h"
#include "camera.h"
#include "meshfield.h"
#include "player.h"
#include "sphere.h"
#include "input.h"

//==============================================================================
// 静的メンバ変数宣言
//==============================================================================
CMeshfield *CExe::m_pMeshField = NULL;		// メッシュフィールドクラス
CPlayer *CExe::m_pPlayer = NULL;
CSphere *CExe::m_pSphere = NULL;			// 球体クラス
CExe::EDITMODE CExe::m_editMode = EDITMODE_EDIT;

//==============================================================================
// コンストラクタ
//==============================================================================
CExe::CExe()
{
}

//==============================================================================
// デストラクタ
//==============================================================================
CExe::~CExe()
{
}

//==============================================================================
// ゲームモードの初期化処理
//==============================================================================
HRESULT CExe::Init(void)
{
	// カメラの位置初期化
	CCamera *pCamera = CManager::GetCamera();

	pCamera->SetInit();

	// メッシュフィールドの生成
	m_pMeshField = CMeshfield::Create();

	// プレイヤーの生成
	m_pPlayer = CPlayer::Create();

	// 球体生成
	//m_pSphere = CSphere::Create();

	return S_OK;
}

//==============================================================================
// ゲームモードの終了処理
//==============================================================================
void CExe::Uninit(void)
{


	Release();	// インスタンスのデリート
}

//==============================================================================
// ゲームモードの更新処理
//==============================================================================
void CExe::Update(void)
{
	// キーボードの取得
	CInputKeyboard *keyboard = CManager::GetInputKeyboard();

	if (keyboard->GetTrigger(CInput::KEYINFO_MODECHANGE) == true)
	{
		ChangeEditMode();
	}
}

//==============================================================================
// ゲームモードの描画処理
//==============================================================================
void CExe::Draw(void)
{

}

//==============================================================================
// ゲームモードの生成処理
//==============================================================================
CExe *CExe::Create()
{
	// インスタンス生成
	CExe *pExe;
	pExe = new CExe;

	// 初期化
	if (pExe != NULL)
	{
		pExe->Init();
	}

	return pExe;
}

//==============================================================================
// 編集モードの切り替え
//==============================================================================
void CExe::ChangeEditMode(void)
{
	m_editMode = (EDITMODE)(m_editMode + 1);

	if (m_editMode >= EDITMODE_MAX)
	{
		m_editMode = (EDITMODE)0;
	}
}