//==============================================================================
//
// ゲーム画面の描画〔game.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _GAME_H_
#define _GAME_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define MAX_STAGE		(3)		// ステージ数
#define START_NUM		(0)		// 開始ステージ

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitGame(void);		// ゲーム画面の初期化処理
void UninitGame(void);		// ゲーム画面の終了処理
void UpdateGame(void);		// ゲーム画面の更新処理
void DrawGame(void);		// ゲーム画面の描画処理
//HRESULT InitGameCnt(void);	// ステージカウントの初期化

#endif