//==============================================================================
//
// ライトの設定〔light.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _LIGHT_H_
#define _LIGHT_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
void InitLight(void);		// ライトの初期化処理
void UninitLight(void);		// ライトの終了処理
void UpdateLight(void);		// ライトの更新処理

#endif
