//==============================================================================
//
// ゲーム開始処理の描画〔start.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _START_H_
#define _START_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define START_POLY	(4)

//==============================================================================
// 開始処理の詳細情報
//==============================================================================
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXCOLOR col;
	bool bUse;
}StartInfo;

//==============================================================================
// 開始処理の構造体
//==============================================================================
typedef struct
{
	LPDIRECT3DTEXTURE9 pTexture[START_POLY] = {};	// スコアテクスチャーへのポインタ
	LPDIRECT3DVERTEXBUFFER9 pVtxBuff = NULL;		// スコアバッファへのポインタ
	StartInfo startInfo[START_POLY];
	int nStartCnt;
	bool bStart;
}Start;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitStart(void);	// ゲーム開始処理の初期化処理
void UninitStart(void);		// ゲーム開始処理の終了処理
void UpdateStart(void);		// ゲーム開始処理の更新処理
void DrawStart(void);		// ゲーム開始処理の描画処理
Start GetStart(void);		// 開始処理の情報取得

#endif