//==============================================================================
//
// 体力の描画〔life.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _LIFE_H_
#define _LIFE_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitLife(void);	// 体力の初期化処理
void UninitLife(void);	// 体力の終了処理
void UpdateLife(void);	// 体力の更新処理
void DrawLife(void);	// 体力の描画処理

#endif