//==============================================================================
//
// タイマーの描画〔timer.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _TIMER_H_
#define _TIMER_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define MAX_TIMER	(3)	// 桁の最大数

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitTimer(void);					// タイマーの初期化処理
void UninitTimer(void);						// タイマーの終了処理
void UpdateTimer(void);						// タイマーの更新処理
void DrawTimer(void);						// タイマーの描画処理
void SetVertexTimer(int nIdx, int nNumber);	// タイマーの座標情報取得
int GetTimer(void);							// タイマー情報の取得
void SetTimer(void);						// タイマーのステージごとの初期設定

#endif
