//==============================================================================
//
// チュートリアルロゴの描画〔tutorial_logo.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _TUTORIAL_LOGO_H_
#define _TUTORIAL_LOGO_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define TUTOLOGO_NUM	(2)	// 表示ロゴの種類

//==============================================================================
// チュートリアルロゴの情報
//==============================================================================
typedef struct
{
	LPDIRECT3DTEXTURE9 pTextureTutoLogo = NULL;			// チュートリアル画面テクスチャへのポインタ
	D3DXVECTOR3 pos;
	D3DXCOLOR col;
	bool bUse;
}TutoLogoInfo;

//==============================================================================
// チュートリアルロゴの構造体
//==============================================================================
typedef struct
{
	LPDIRECT3DVERTEXBUFFER9 pVtxBuffTutoLogo = NULL;	// バッファへのポインタ
	TutoLogoInfo tutologoInfo[TUTOLOGO_NUM];
	int nCntAnim;
	bool bFadeTuto;
}TutoLogo;

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitTutoLogo(void);		// チュートリアルロゴの初期化処理
void UninitTutoLogo(void);		// チュートリアルロゴの終了処理
void UpdateTutoLogo(void);		// チュートリアルロゴの更新処理
void DrawTutoLogo(void);		// チュートリアルロゴの描画処理
TutoLogo *GetTutoLogo(void);	// チュートリアルロゴの取得

#endif