//==============================================================================
//
// チュートリアルの描画〔tutorial.cpp〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#include "tutorial.h"
#include "tutorial_logo.h"
#include "tutorial_main.h"

//==============================================================================
// チュートリアルの初期化処理
//==============================================================================
HRESULT InitTutorial(void)
{
	// チュートリアル画面の初期化
	InitTutoMain();

	// チュートリアルロゴの初期化
	InitTutoLogo();

	return S_OK;
}

//==============================================================================
// チュートリアルの終了処理
//==============================================================================
void UninitTutorial(void)
{
	// チュートリアル画面の終了処理
	UninitTutoMain();

	// チュートリアルロゴの終了処理
	UninitTutoLogo();
}

//==============================================================================
// チュートリアルの更新処理
//==============================================================================
void UpdateTutorial(void)
{
	// チュートリアル画面の更新処理
	UpdateTutoMain();

	// チュートリアルロゴの更新処理
	UpdateTutoLogo();
}

//==============================================================================
// チュートリアルの描画処理
//==============================================================================
void DrawTutorial(void)
{
	// チュートリアル画面の描画処理
	DrawTutoMain();

	// チュートリアルロゴの描画処理
	DrawTutoLogo();
}