//==============================================================================
//
// セーフティラインの描画〔line.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _LINE_H_
#define _LINE_H_
#include "main.h"

//==============================================================================
// マクロ定義
//==============================================================================
#define LINE_REMIT		(10)	// ライン越えのリミット

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitLine(void);	// セーフティラインの初期化処理
void UninitLine(void);	// セーフティラインの終了処理
void UpdateLine(void);	// セーフティラインの更新処理
void DrawLine(void);	// セーフティラインの描画処理

#endif
