//==============================================================================
//
// 残機の描画〔stock.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _STOCK_H_
#define _STOCK_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitStock(void);	// 残機表示の初期化処理
void UninitStock(void);		// 残機表示の終了処理
void UpdateStock(void);		// 残機表示の更新処理
void DrawStock(void);		// 残機表示の描画処理

#endif
